// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Написать программу, которая из имеющегося массива целых чисел формирует массив из четных чисел.
// Первоначальный массив можно ввести с клавиатуры, либо сгенерировать случайным образом. 
 //При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

 